NordicSemiconductor/nrfx/mdk/nrf54h20_engb_application_peripherals.h
/*

Copyright (c) 2010 - 2024, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_ENGB_APPLICATION_PERIPHERALS_H
#define NRF54H20_ENGB_APPLICATION_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*Extended UICR.*/
#define UICREXTENDED_PRESENT 1
#define UICREXTENDED_COUNT 1

/*CACHEDATA*/
#define ICACHEDATA_PRESENT 1
#define ICACHEDATA_COUNT 1

#define ICACHEDATA_NUMSETS 256                       /*!< Number of sets : 256                                                 */
#define ICACHEDATA_NUMWAYS 2                         /*!< Number of ways : 2                                                   */
#define ICACHEDATA_NUMDATAUNIT 4                     /*!< Number of data units : 4                                             */
#define ICACHEDATA_DATAWIDTH 2                       /*!< Data width of a data unit : 2 word(s)                                */

/*CACHEINFO*/
#define ICACHEINFO_PRESENT 1
#define ICACHEINFO_COUNT 1

#define ICACHEINFO_NUMSETS 256                       /*!< Number of sets : 256                                                 */
#define ICACHEINFO_NUMWAYS 2                         /*!< Number of ways : 2                                                   */
#define ICACHEINFO_NUMDATAUNIT 4                     /*!< Number of data units : 4                                             */
#define ICACHEINFO_DATAWIDTH 2                       /*!< Data width of a data unit : 2 word(s)                                */
#define ICACHEINFO_TAGWIDTH 19                       /*!< TAG width : 19                                                       */
#define ICACHEINFO_DU_EXTENSION 0                    /*!< (unspecified)                                                        */

/*User information configuration registers*/
#define UICR_PRESENT 1
#define UICR_COUNT 1

/*Board information configuration registers*/
#define BICR_PRESENT 1
#define BICR_COUNT 1

#define BICR_P0_INTERNAL 1                           /*!< (unspecified)                                                        */
#define BICR_P0_POWER 0                              /*!< (unspecified)                                                        */
#define BICR_P1_POWER 1                              /*!< (unspecified)                                                        */
#define BICR_P2_POWER 1                              /*!< (unspecified)                                                        */
#define BICR_P3_POWER 0                              /*!< (unspecified)                                                        */
#define BICR_P4_POWER 0                              /*!< (unspecified)                                                        */
#define BICR_P5_POWER 0                              /*!< (unspecified)                                                        */
#define BICR_P6_POWER 1                              /*!< (unspecified)                                                        */
#define BICR_P7_POWER 1                              /*!< (unspecified)                                                        */
#define BICR_P8_POWER 0                              /*!< (unspecified)                                                        */
#define BICR_P9_POWER 1                              /*!< (unspecified)                                                        */
#define BICR_P10_POWER 0                             /*!< (unspecified)                                                        */
#define BICR_P11_POWER 0                             /*!< (unspecified)                                                        */
#define BICR_P12_POWER 0                             /*!< (unspecified)                                                        */
#define BICR_P13_POWER 0                             /*!< (unspecified)                                                        */
#define BICR_P14_POWER 0                             /*!< (unspecified)                                                        */
#define BICR_P15_POWER 0                             /*!< (unspecified)                                                        */
#define BICR_P0_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P1_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P2_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P3_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P4_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P5_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P6_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P7_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P8_POWER_3V 0                           /*!< (unspecified)                                                        */
#define BICR_P9_POWER_3V 1                           /*!< (unspecified)                                                        */
#define BICR_P10_POWER_3V 0                          /*!< (unspecified)                                                        */
#define BICR_P11_POWER_3V 0                          /*!< (unspecified)                                                        */
#define BICR_P12_POWER_3V 0                          /*!< (unspecified)                                                        */
#define BICR_P13_POWER_3V 0                          /*!< (unspecified)                                                        */
#define BICR_P14_POWER_3V 0                          /*!< (unspecified)                                                        */
#define BICR_P15_POWER_3V 0                          /*!< (unspecified)                                                        */
#define BICR_P0_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P1_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P2_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P3_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P4_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P5_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P6_DRIVECTRL 1                          /*!< (unspecified)                                                        */
#define BICR_P7_DRIVECTRL 1                          /*!< (unspecified)                                                        */
#define BICR_P8_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P9_DRIVECTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P10_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P11_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P12_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P13_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P14_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P15_DRIVECTRL 0                         /*!< (unspecified)                                                        */
#define BICR_P0_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P1_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P2_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P3_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P4_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P5_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P6_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P7_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P8_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P9_BIASCTRL 0                           /*!< (unspecified)                                                        */
#define BICR_P10_BIASCTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P11_BIASCTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P12_BIASCTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P13_BIASCTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P14_BIASCTRL 0                          /*!< (unspecified)                                                        */
#define BICR_P15_BIASCTRL 0                          /*!< (unspecified)                                                        */
#define BICR_PMICLDO 0                               /*!< (unspecified)                                                        */

/*CACHEDATA*/
#define DCACHEDATA_PRESENT 1
#define DCACHEDATA_COUNT 1

