NordicSemiconductor/nrfx/mdk/nrf54h20_engb_application_peripherals.h
#define TWIS133_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS134_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS135_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS136_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS137_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

/* ============================================= SPU010 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU010.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_0  = 0,    /*!< Index of access permissions for channel 0 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_1  = 1,    /*!< Index of access permissions for channel 1 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_2  = 2,    /*!< Index of access permissions for channel 2 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_CH_3  = 3,    /*!< Index of access permissions for channel 3 of IPCT                    */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_INTERRUPT_0 = 24, /*!< Index of access permissions for interrupt 0 of IPCT              */
  NRF_APPLICATION_SPU010_FEATURES_IPCT_INTERRUPT_1 = 25, /*!< Index of access permissions for interrupt 1 of IPCT              */
} NRF_APPLICATION_SPU010_FEATURES_ENUM_t;


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_ENGB_APPLICATION_PERIPHERALS_H */

